
### :robot: Terraform Report
---
##### Plan: `7` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "innovatsmanager"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "eastus"
      + name                                = "innovats-cluster-manager"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "infra-cluster-manager"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + auto_scaling_enabled = false
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "admnodes"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2ps_v5"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip     = "10.0.0.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = "10.244.0.0/16"
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.0.0.0/16"
          + service_cidrs      = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster_node_pool.app_node_pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "app_node_pool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 2
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "appnodes"
      + node_count            = 1
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D2ps_v5"
      + vnet_subnet_id        = (known after apply)
    }

  # azurerm_network_security_group.aks_nsg will be created
  + resource "azurerm_network_security_group" "aks_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "aks-nsg"
      + resource_group_name = "infra-cluster-manager"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-HTTPS"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-HTTP"
              + priority                                   = 1000
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Deny-All"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_resource_group.cluster_manager will be created
  + resource "azurerm_resource_group" "cluster_manager" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "infra-cluster-manager"
      + tags     = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
    }

  # azurerm_subnet.aks_subnet will be created
  + resource "azurerm_subnet" "aks_subnet" {
      + address_prefixes                              = [
          + "10.30.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aks-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "infra-cluster-manager"
      + virtual_network_name                          = "main-vnet"
    }

  # azurerm_subnet_network_security_group_association.aks_subnet_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "aks_subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.30.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "main-vnet"
      + resource_group_name = "infra-cluster-manager"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_api_server_url     = (sensitive value)

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11302000013`](https://github.com/innovats-hub/azure-cluster-manager/actions/runs/11302000013) - commit 1bf9132129fc5112f68e2db819026c9e543d5723
